app/Controllers/Siswa/Pendaftaran.php

SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT *
FROM `pendaftaran`
WHERE `id_user` = '96'
 LIMIT 1
SELECT *
FROM `agama`
SELECT *
FROM `pekerjaan`
SELECT *
FROM `persyaratan`
---
    public function index()
    {
        $pendaftaranModel = new PendaftaranModel();
        $pengaturanModel = new PengaturanModel();

        $pengaturan = $pengaturanModel->first();
        if ($pengaturan && $pengaturan->is_open == 0) {
            return redirect()->to('/siswa/dashboard')->with('error', 'Masa pendaftaran sedang ditutup.');
        }

        $id_user = session()->get('id');
        $cekDaftar = $pendaftaranModel->where('id_user', $id_user)->first();

        if ($cekDaftar && $cekDaftar->status_pendaftaran != 'Perbaikan') {
            return redirect()->to('/siswa/dashboard');
        }

        $data = [
            'agama'       => (new AgamaModel())->findAll(),
            'pekerjaan'   => (new PekerjaanModel())->findAll(),
            'persyaratan' => (new PersyaratanModel())->findAll(),
            'alamat'      => (new AlamatModel())->findAll(),
            'pendidikan'  => (new PendidikanModel())->findAll(),
            'tk'          => (new TkModel())->findAll(),
            'pendaftaran' => $cekDaftar
        ];