app/Controllers/Admin/Alamat.php

SELECT *
FROM `alamat`
---
    public function index()
    {
        $data['alamat'] = $this->alamatModel->findAll();