app/Controllers/Admin/Konfirmasi.php

SELECT *
FROM `pendaftaran`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data['pendaftar'] = $this->pendaftaranModel->orderBy('created_at', 'DESC')->findAll();

SELECT `pendaftaran`.*, `a`.`nama_agama`, `tk`.`nama_tk` as `tk_pilihan`, `pk_a`.`nama_pekerjaan` as `pk_ayah`, `pk_i`.`nama_pekerjaan` as `pk_ibu`, `al`.`provinsi`, `al`.`kabupaten`, `al`.`kecamatan`, `al`.`desa`
FROM `pendaftaran`
LEFT JOIN `agama` as `a` ON `a`.`id` = `pendaftaran`.`id_agama`
LEFT JOIN `taman_kanak_kanak` as `tk` ON `tk`.`id` = `pendaftaran`.`id_tk`
LEFT JOIN `pekerjaan` as `pk_a` ON `pk_a`.`id` = `pendaftaran`.`id_pekerjaan_ayah`
LEFT JOIN `pekerjaan` as `pk_i` ON `pk_i`.`id` = `pendaftaran`.`id_pekerjaan_ibu`
LEFT JOIN `alamat` as `al` ON `al`.`id` = `pendaftaran`.`id_alamat`
WHERE `pendaftaran`.`id` = '143'
SELECT `berkas_pendaftaran`.*, `persyaratan`.`nama_persyaratan`
FROM `berkas_pendaftaran`
JOIN `persyaratan` ON `persyaratan`.`id` = `berkas_pendaftaran`.`id_persyaratan`
WHERE `id_pendaftaran` = '143'
SELECT `berkas_pendaftaran`.`file_path`
FROM `berkas_pendaftaran`
JOIN `persyaratan` ON `persyaratan`.`id` = `berkas_pendaftaran`.`id_persyaratan`
WHERE `id_pendaftaran` = '143'
AND  `persyaratan`.`nama_persyaratan` LIKE '%Pas Photo%' ESCAPE '!'
 LIMIT 1
---
    public function detail($id)
    {
        $berkasModel = new BerkasPendaftaranModel();

        $data['pendaftaran'] = $this->pendaftaranModel
            ->select('pendaftaran.*, a.nama_agama, tk.nama_tk as tk_pilihan, pk_a.nama_pekerjaan as pk_ayah, pk_i.nama_pekerjaan as pk_ibu, al.provinsi, al.kabupaten, al.kecamatan, al.desa')
            ->join('agama as a', 'a.id = pendaftaran.id_agama', 'left')
            ->join('taman_kanak_kanak as tk', 'tk.id = pendaftaran.id_tk', 'left')
            ->join('pekerjaan as pk_a', 'pk_a.id = pendaftaran.id_pekerjaan_ayah', 'left')
            ->join('pekerjaan as pk_i', 'pk_i.id = pendaftaran.id_pekerjaan_ibu', 'left')
            ->join('alamat as al', 'al.id = pendaftaran.id_alamat', 'left')
            ->find($id);

        $data['berkas'] = $berkasModel->select('berkas_pendaftaran.*, persyaratan.nama_persyaratan')
                                      ->join('persyaratan', 'persyaratan.id = berkas_pendaftaran.id_persyaratan')
                                      ->where('id_pendaftaran', $id)
                                      ->findAll();

        $data['pas_foto'] = $berkasModel->select('berkas_pendaftaran.file_path')
                                        ->join('persyaratan', 'persyaratan.id = berkas_pendaftaran.id_persyaratan')
                                        ->where('id_pendaftaran', $id)
                                        ->like('persyaratan.nama_persyaratan', 'Pas Photo')
                                        ->first();