app/Controllers/Admin/Pendidikan.php

    public function index()
    {
        $data['pendidikan'] = $this->pendidikanModel->findAll();
---
SELECT *
FROM `pendidikan`