app/Controllers/Admin/SiswaUser.php

SELECT *
FROM `users`
WHERE `level` = 'siswa'
---
    public function index()
    {
        $data['users'] = $this->userModel->where('level', 'siswa')->findAll();

UPDATE `users` SET `nama_lengkap` = 'Mustafa Arifin', `username` = 'siswa', `password` = '$2y$10$vBKxC41xp9CgRsrUoJqhH.GdeJmS.xlAjObPoNJhzn4AFwsJt.UKK', `updated_at` = '2026-04-10 16:07:00'
WHERE `users`.`id` IN ('2')
---
    public function update($id)
    {
        $data = [
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'username'     => $this->request->getPost('username')
        ];

        $password = $this->request->getPost('password');
        if (!empty($password)) {
            $data['password'] = password_hash($password, PASSWORD_DEFAULT);
        }

        $this->userModel->update($id, $data);